<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Jfindmyfiles-commits] r28 - trunk/docs
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/jfindmyfiles-commits/2008-April/index.html" >
   <LINK REL="made" HREF="mailto:jfindmyfiles-commits%40lists.berlios.de?Subject=Re%3A%20%5BJfindmyfiles-commits%5D%20r28%20-%20trunk/docs&In-Reply-To=%3C200804101621.m3AGLmiR011557%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000023.html">
   <LINK REL="Next"  HREF="000025.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Jfindmyfiles-commits] r28 - trunk/docs</H1>
    <B>knitter at mail.berlios.de</B> 
    <A HREF="mailto:jfindmyfiles-commits%40lists.berlios.de?Subject=Re%3A%20%5BJfindmyfiles-commits%5D%20r28%20-%20trunk/docs&In-Reply-To=%3C200804101621.m3AGLmiR011557%40sheep.berlios.de%3E"
       TITLE="[Jfindmyfiles-commits] r28 - trunk/docs">knitter at mail.berlios.de
       </A><BR>
    <I>Thu Apr 10 18:21:48 CEST 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="000023.html">[Jfindmyfiles-commits] r27 - in trunk: . docs
</A></li>
        <LI>Next message: <A HREF="000025.html">[Jfindmyfiles-commits] r29 -	trunk/spikes/Prototipos/src/de/berlios/kcookb/prototipos
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#24">[ date ]</a>
              <a href="thread.html#24">[ thread ]</a>
              <a href="subject.html#24">[ subject ]</a>
              <a href="author.html#24">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: knitter
Date: 2008-04-10 18:21:45 +0200 (Thu, 10 Apr 2008)
New Revision: 28

Added:
   trunk/docs/[XPDoc]User Stories.txt
Removed:
   trunk/docs/Lista de Requisitos.txt
Modified:
   trunk/docs/TODO
   trunk/docs/[Justificacao] Metodologia usada.txt
Log:
Actualiza?\195?\167?\195?\163o de alguns textos e altera?\195?\167?\195?\163o do nome do ficheiro Lista de Requisitos.txt para [XPDoc]User Stories de forma a real?\195?\167ar o conte?\195?\186do dado que ?\195?\169 um documento da metodologia e cont?\195?\169m as user stories usadas.

Deleted: trunk/docs/Lista de Requisitos.txt
===================================================================
--- trunk/docs/Lista de Requisitos.txt	2008-04-10 13:46:45 UTC (rev 27)
+++ trunk/docs/Lista de Requisitos.txt	2008-04-10 16:21:45 UTC (rev 28)
@@ -1,17 +0,0 @@
-Os seguintes requisitos devem ser cumpridos pelo sistema:
-R1: Permitir ler e guardar para cada ficheiro o seu nome, o seu caminho completo, o 
-seu tamanho, a sua extens&#227;o, data de cria&#231;&#227;o e atributos
-
-R2: Permitir a introdu&#231;&#227;o de uma descri&#231;&#227;o e uma categoria;
-	
-
-
-O software JFindMyFiles pretende fazer a gest&#227;o dos diversos documentos digitais 
-comuns aos utilizadores de computadores. Nessa gest&#227;o ser&#225; importante que mantenha 
-pelo menos as seguintes caracteristicas para cada ficheiro:
-
-
-O sistema dever&#225; dispor tamb&#233;m de um mecanismo que permita extender o conjunto 
-de informa&#231;&#245;es guardadas. Assim dever&#225; possuir uma API que possibilite a 
-programa&#231;&#227;o de plugins para o fornecimento de informa&#231;&#245;es mais detalhadas ou 
-informa&#231;&#245;es n&#227;o contenpladas inicialmente.

Modified: trunk/docs/TODO
===================================================================
--- trunk/docs/TODO	2008-04-10 13:46:45 UTC (rev 27)
+++ trunk/docs/TODO	2008-04-10 16:21:45 UTC (rev 28)
@@ -3,4 +3,6 @@
 Indicar na sec&#231;&#227;o de controlo de vers&#245;es que a metodologia usada anda de m&#227;os 
 dadas com um sistema de controlo de vers&#245;es.
 - Falar sobre a calendariza&#231;&#227;o que muda frequentemente.
-- Na justifica&#231;&#227;o da plataforma NB VS Eclipse RCP falta indicar o nome da revista.
\ No newline at end of file
+- Na justifica&#231;&#227;o da plataforma NB VS Eclipse RCP falta indicar o nome da revista.
+- Ser&#225; necess&#225;rio falar das caracteristicas da metodologia como standards de 
+c&#243;digo?
\ No newline at end of file

Modified: trunk/docs/[Justificacao] Metodologia usada.txt
===================================================================
--- trunk/docs/[Justificacao] Metodologia usada.txt	2008-04-10 13:46:45 UTC (rev 27)
+++ trunk/docs/[Justificacao] Metodologia usada.txt	2008-04-10 16:21:45 UTC (rev 28)
@@ -23,6 +23,7 @@
 projecto e caracteristicas da equipa de desenvolvimento pelo que foi essa a 
 seguida durante o processo de desenvolvimento e de gest&#227;o do projecto.
 
+<A HREF="http://en.wikipedia.org/wiki/Extreme_Programming">http://en.wikipedia.org/wiki/Extreme_Programming</A>
 <A HREF="http://www.extremeprogramming.org">http://www.extremeprogramming.org</A>
 Agile Development with ICONIX Process, Doug Rosenberg, Matt Stephens, 
 Mark Collins-Cope, Apress
\ No newline at end of file

Copied: trunk/docs/[XPDoc]User Stories.txt (from rev 26, trunk/docs/Lista de Requisitos.txt)
===================================================================
--- trunk/docs/Lista de Requisitos.txt	2008-04-09 22:09:42 UTC (rev 26)
+++ trunk/docs/[XPDoc]User Stories.txt	2008-04-10 16:21:45 UTC (rev 28)
@@ -0,0 +1,93 @@
+ST1:
+O programa tem de permitir que se possa indicar a pasta a ler e tem de ler o 
+conte&#250;do dessa pasta e guardar as informa&#231;&#245;es dos ficheiros.
+
+ST2:
+Deve ser poss&#237;vel introduzir uma descri&#231;&#227;o para cada elemento existente.
+
+ST3:
+As pastas lidas devem poder ser organizadas por categorias, devem tamb&#233;m poder 
+ser agrupadas em grupos de discos.
+
+ST4:
+Quando se trata de um disco amov&#237;vel deve existir a possibilidade de guardar a 
+localiza&#231;&#227;o f&#237;sica do disco.
+
+ST5:
+O programa tem de permitir criar cat&#225;logos, abrir cat&#225;logos, manter um registo 
+de cat&#225;logos recentes, fechar e guardar cat&#225;logos.
+
+ST6:
+Os discos e pastas podem ser catalogados usando etiquetas, o sistema deve ser 
+independente das categorias e grupos de discos e permitir que o mesmo disco 
+tenha mais que uma categoria.
+
+ST7:
+Preciso encontrar um ficheiro no cat&#225;logo, para isso quero escolher a categoria, 
+grupo de discos, ou todo o cat&#225;logo para restringir a pesquisa.
+
+ST8:
+A aplica&#231;&#227;o deve permitir ser distrubuida em mais que uma l&#237;ngua, deve ser 
+internacionaliz&#225;vel.
+
+ST9:
+Sistema de estat&#237;sticas que mostre dados relevantes sobre os ficheiros 
+existentes como o n&#250;mero de ficheiros de determinado tipo, o tamanho m&#233;dio dos 
+ficheiros catalogados, o tamanho total ocupado, etc..
+
+ST10:
+Op&#231;&#245;es para permitir exportar os dados existentes para outros formatos, 
+principalmente para formatos port&#225;veis como XML e CSV.
+
+ST11:
+Op&#231;&#245;es para importar dados de outras bases de dados criadas anteriormente com o 
+programa e de outros formatos providenciados por programas  concorrentes.
+
+ST12:
+Quero exportar um cat&#225;logo completo ou um subconjunto para um conjunto de 
+ficheiros HTML que possam ser colocados on-line ou distribu&#237;dos livremente.
+Devem existir personaliza&#231;&#245;es de aspecto que se possam aplicar aos ficheiros 
+criados.
+
+ST13:
+A pesquisa de ficheiros deve conter op&#231;&#245;es para pesquisar usando express&#245;es 
+regulares.
+
+ST14:
+Quero que as op&#231;&#245;es mais comuns apare&#231;am numa barra acima da lista de ficheiros.
+
+ST15:
+Deve existir um menu na &#225;rvore com a lista de categorias/grupo de discos/etiquetas 
+com op&#231;&#245;es de pesquisa, introdu&#231;&#227;o de descri&#231;&#245;es, altera&#231;&#227;o do nome, 
+exporta&#231;&#227;o e importa&#231;&#227;o.
+ 
+ST16:
+Se a localiza&#231;&#227;o do ficheiro estiver acess&#237;vel deve ser poss&#237;vel abri-la.
+
+ST17:
+O sistema de leitura de informa&#231;&#245;es de ficheiro tem de permitir ser expandido 
+para ler ficheiros desconhecidos ou para que a forma como as informa&#231;&#245;es s&#227;o 
+lidas seja alterada.
+
+ST18:
+Deve ser poss&#237;vel configurar os plugins que est&#227;o activos, tanto numa janela de 
+op&#231;&#245;es como na altura em que se vai ler os discos ou pastas.
+
+ST19:
+Deve ser poss&#237;vel usar base de dados local ou remota, e o programa n&#227;o pode 
+ficar preso a apenas um tipo de base de dados.
+
+ST20:
+Deve ser poss&#237;vel procurar ficheiros duplicados, o nome n&#227;o deve ser limita&#231;&#227;o.
+
+ST21:
+Deve ser poss&#237;vel comparar a informa&#231;&#227;o guardada de um disco ou pasta com o seu 
+conte&#250;do actual, caso o disco ou pasta estejam dispon&#237;veis ao programa.
+
+ST22:
+O programa deve oferecer um sistema de gest&#227;o de sa&#237;das. Deve permitir gerir um 
+conjunto de utilizadores e os empr&#233;stimos feitos a esses utilizadores.
+
+ST23:
+Deve ser poss&#237;vel adicionar, remover e editar os dados de utilizadores, bem como 
+ver os empr&#233;stimos actuais e passados feitos a esse utilizador.


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000023.html">[Jfindmyfiles-commits] r27 - in trunk: . docs
</A></li>
	<LI>Next message: <A HREF="000025.html">[Jfindmyfiles-commits] r29 -	trunk/spikes/Prototipos/src/de/berlios/kcookb/prototipos
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#24">[ date ]</a>
              <a href="thread.html#24">[ thread ]</a>
              <a href="subject.html#24">[ subject ]</a>
              <a href="author.html#24">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/jfindmyfiles-commits">More information about the Jfindmyfiles-commits
mailing list</a><br>
</body></html>
