<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Jfindmyfiles-commits] r252 -	trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/jfindmyfiles-commits/2008-July/index.html" >
   <LINK REL="made" HREF="mailto:jfindmyfiles-commits%40lists.berlios.de?Subject=Re%3A%20%5BJfindmyfiles-commits%5D%20r252%20-%0A%09trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs&In-Reply-To=%3C200807221331.m6MDVqM0016804%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000246.html">
   <LINK REL="Next"  HREF="000248.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Jfindmyfiles-commits] r252 -	trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs</H1>
    <B>tica at mail.berlios.de</B> 
    <A HREF="mailto:jfindmyfiles-commits%40lists.berlios.de?Subject=Re%3A%20%5BJfindmyfiles-commits%5D%20r252%20-%0A%09trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs&In-Reply-To=%3C200807221331.m6MDVqM0016804%40sheep.berlios.de%3E"
       TITLE="[Jfindmyfiles-commits] r252 -	trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs">tica at mail.berlios.de
       </A><BR>
    <I>Tue Jul 22 15:31:52 CEST 2008</I>
    <P><UL>
        <LI>Previous message: <A HREF="000246.html">[Jfindmyfiles-commits] r251 - trunk
</A></li>
        <LI>Next message: <A HREF="000248.html">[Jfindmyfiles-commits] r253 - in trunk: . docs docs/Documentos	Externos docs/Documentos Externos/Imagens Obtidas	docs/Imagens Criadas docs/Imagens Criadas/Exemplo de Utilizacao	project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#247">[ date ]</a>
              <a href="thread.html#247">[ thread ]</a>
              <a href="subject.html#247">[ subject ]</a>
              <a href="author.html#247">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: tica
Date: 2008-07-22 15:31:50 +0200 (Tue, 22 Jul 2008)
New Revision: 252

Added:
   trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs/jfindmyfiles-catalog.html
   trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs/jfindmyfiles-drives-linux.html
Log:
adicionados dois ficheiros de ajuda

Added: trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs/jfindmyfiles-catalog.html
===================================================================
--- trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs/jfindmyfiles-catalog.html	2008-07-22 13:08:31 UTC (rev 251)
+++ trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs/jfindmyfiles-catalog.html	2008-07-22 13:31:50 UTC (rev 252)
@@ -0,0 +1,116 @@
+&lt;!-- 
+    Document   : jfindmyfiles-catalog
+    Created on : 22/Jul/2008, 14:10:43
+    Author     : Administrador
+--&gt;
+&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Transitional//EN&quot;&gt;
+&lt;html&gt;
+  &lt;head&gt;
+    &lt;title&gt;Utiliza&#231;&#227;o do programa&lt;/title&gt;
+    &lt;meta http-equiv=&quot;Content-Type&quot; content=&quot;text/html; charset=UTF-8&quot;&gt;
+  &lt;/head&gt;
+  &lt;body&gt;
+    &lt;h2&gt;Criar Cat&#225;logo&lt;/h2&gt;
+        &lt;p&gt;
+            Para criar um novo cat&#225;logo &#233; necess&#225;rio decidir primeiro o tipo de base de dados que ser&#225;
+        usada para guardar as informa&#231;&#245;es.
+            Est&#227;o dispon&#237;veis v&#225;rios motores de bases de dados, que ter&#227;o de ser configurados pelo
+        utilizador, ou uma base de dados interna, sem qualquer necessidade de configura&#231;&#227;o para o
+        utilizador. A escolha depender&#225; do objectivo e das caracter&#237;sticas do utilizador.   
+            Se n&#227;o tem conhecimentos sobre instala&#231;&#227;o de servidores de bases de dados, &#233; recomendado
+        que escolha a op&#231;&#227;o de base de dados local. Se possui j&#225; um servidor que pretende usar, ent&#227;o
+        poder&#225; escolher a op&#231;&#227;o de rede e introduzir os dados referentes ao servidor.
+            Na op&#231;&#227;o de base de dados local, uma base de dados ser&#225; composta por v&#225;rios ficheiros em
+        disco, durante a cria&#231;&#227;o do cat&#225;logo ser&#225; criada um pasta onde esses ficheiros ir&#227;o residir. Por
+        omiss&#227;o essa pasta ser&#225; criada na pasta pessoal do utilizador. Esta localiza&#231;&#227;o poder&#225; ser
+        alterada na janela de cria&#231;&#227;o de novos cat&#225;logos ou nas op&#231;&#245;es da aplica&#231;&#227;o.
+        &lt;/p&gt;
+        &lt;h2&gt;Os diferentes tipos de base de dados&lt;/h2&gt;
+        &lt;p&gt;
+            O programa suporta alguns motores de bases de dados comuns. &#201; assim poss&#237;vel escolher o
+        servidor que mais se adequar &#224; situa&#231;&#227;o.
+            Ao escolher criar um novo cat&#225;logo tem a possibilidade de indicar qual o tipo de servidor que
+        pretende usar. &#201; necess&#225;rio que este servidor esteja j&#225; configurado e que exista uma base de
+        dados e um utilizador com as configura&#231;&#245;es que indicar.
+            O programa n&#227;o cria a base de dados, cria apenas as tabelas que a comp&#245;em, todas as
+        configura&#231;&#245;es, como a instala&#231;&#227;o do servidor, cria&#231;&#227;o de uma base de dados e cria&#231;&#227;o de um
+        utilizador com as permiss&#245;es correctas, t&#234;m de ser feitas antes de se tentar criar um novo
+        cat&#225;logo.
+            Actualmente, os servidores suportados s&#227;o: MySQL, MS SQL Server 2005, Firebird e
+        PostgreSQL. N&#227;o foi testada a vers&#227;o 2008 do MS SQL Server, por esse motivo a mesma n&#227;o
+        &#233; oficialmente suportada.
+        &lt;/p&gt;
+        &lt;h2&gt;Abrir Cat&#225;logo&lt;/h2&gt;
+        &lt;p&gt;
+            A abertura de um cat&#225;logo &#233; semelhante ao processo de cria&#231;&#227;o
+        Se estiver a usar a op&#231;&#227;o de base de dados local, poder&#225; simplesmente navegar at&#233; &#224; pasta que
+        cont&#233;m o cat&#225;logo e seleccionar essa pasta. O nome do cat&#225;logo ser&#225; preenchido
+        automaticamente.
+        &lt;/p&gt;
+        &lt;h2&gt;Registo Autom&#225;tico de Altera&#231;&#245;es&lt;/h2&gt;
+        &lt;p&gt;
+            N&#227;o existe uma op&#231;&#227;o espec&#237;fica para guardar os dados, sendo os mesmos guardados
+        automaticamente. O programa regista todas as altera&#231;&#245;es que s&#227;o feitas aos dados, n&#227;o sendo
+        por isso necess&#225;rio ter algum cuidado espec&#237;fico em guardar manualmente as altera&#231;&#245;es.
+        &lt;/p&gt;
+        &lt;h2&gt;Adicionar novos ficheiros&lt;/h2&gt;
+        &lt;p&gt;
+            Novos ficheiros s&#227;o adicionados atrav&#233;s da leitura de dispositivos de armazenamento. N&#227;o &#233;
+        poss&#237;vel adicionar apenas um ficheiro, a adi&#231;&#227;o ter&#225; de ser sempre de novos discos, novas
+        pastas, ou outro dispositivo de armazenamento acess&#237;vel ao computador.
+        Ao adicionar um novo disco, Figura 3, &#233; poss&#237;vel alterar o nome do disco que ser&#225; guardado
+        no cat&#225;logo, indicar o Grupo de Discos ao qual o novo disco ser&#225; adicionado e indicar se ser&#225;
+        feito o c&#225;lculo do c&#243;digo SHA-1. Este c&#243;digo &#233; usando em funcionalidades avan&#231;adas e
+        embora a sua cria&#231;&#227;o seja opcional, essas funcionalidades n&#227;o estar&#227;o dispon&#237;veis em
+        informa&#231;&#245;es de ficheiros sem o c&#243;digo calculado.
+        &lt;/p&gt;
+        &lt;h2&gt;Pesquisar informa&#231;&#245;es&lt;/h2&gt;
+        &lt;p&gt;
+            &#201; poss&#237;vel pesquisar ficheiros catalogados atrav&#233;s do seu nome, ou de uma palavra ou frase
+        presente na sua descri&#231;&#227;o. A pesquisa pode ser sens&#237;vel a mai&#250;sculas e ser restrita a um grupo
+        de discos.
+        &lt;/p&gt;
+        &lt;h2&gt;Importar dados&lt;/h2&gt;
+        &lt;p&gt;
+            A importa&#231;&#227;o de dados est&#225; dispon&#237;vel para ficheiros XML, previamente criados pelo
+        JFindMyFiles.
+        Para importar dados exportados anteriormente, basta indicar o nome do ficheiro que cont&#233;m
+        os dados a exportar.
+        &lt;/p&gt;
+        &lt;h2&gt;Exportar dados&lt;/h2&gt;
+        &lt;p&gt;
+            A exporta&#231;&#227;o de dados est&#225; dispon&#237;vel em duas op&#231;&#245;es, exporta&#231;&#227;o simples, usada para
+        exportar todos os dados para um ficheiro de texto num formato port&#225;vel, XML ou CSV, e
+        exporta&#231;&#227;o usando templates.
+        &lt;/p&gt;  
+        &lt;h3&gt;Exporta&#231;&#227;o simples&lt;/h3&gt;
+        &lt;p&gt;
+            Para a exporta&#231;&#227;o simples &#233; apenas necess&#225;rio indicar o nome do ficheiro destino.
+        Se pretender exportar imagens, v&#237;deos ou clips de &#225;udio que existam no cat&#225;logo, os mesmos
+        ser&#227;o copiados para a pasta onde foi criado o ficheiro de exporta&#231;&#227;o.
+        Tenha em aten&#231;&#227;o, que se pretender usar o ficheiro de exporta&#231;&#227;o para mais tarde importar no
+        JFindMyFiles, todos os ficheiros de &#225;udio, v&#237;deo e imagem, necessitam estar na mesma pasta
+        que o ficheiro XML.
+        &lt;/p&gt;
+        &lt;h3&gt;Exportar usando templates&lt;/h3&gt;
+        &lt;p&gt;
+            Para exportar os dados usando um template HTML, necessita ter alguns templates instalados.
+        Todos os recursos indicados no template ser&#227;o copiados para a pasta de destino da
+        exporta&#231;&#227;o.
+        &lt;/p&gt;
+        &lt;h2&gt;Obter mais templates&lt;/h2&gt;
+        &lt;p&gt;
+            Caso pretenda obter mais templates poder&#225; consultar a sec&#231;&#227;o de templates no s&#237;tio oficial da
+        aplica&#231;&#227;o, <A HREF="http://jfindmyfiles.berlios.de/templates.">http://jfindmyfiles.berlios.de/templates.</A>
+        &lt;/p&gt;
+        &lt;h2&gt;Instalar Templates&lt;/h2&gt;
+        &lt;p&gt;
+            A instala&#231;&#227;o dos templates faz-se colocando a pasta do template na pasta configurada na
+        janela de op&#231;&#245;es. Se n&#227;o alterou a configura&#231;&#227;o estar&#225; na sua pasta pessoal, dentro da pasta
+        &#8220;.jfmfuserfiles/Templates&#8221;.
+        Caso o seu template venha compactado, descompacte-o e coloque a pasta com todos os
+        ficheiros na pasta de templates.
+        &lt;/p&gt;
+         
+     &lt;/body&gt;
+&lt;/html&gt;

Added: trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs/jfindmyfiles-drives-linux.html
===================================================================
--- trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs/jfindmyfiles-drives-linux.html	2008-07-22 13:08:31 UTC (rev 251)
+++ trunk/project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs/jfindmyfiles-drives-linux.html	2008-07-22 13:31:50 UTC (rev 252)
@@ -0,0 +1,22 @@
+&lt;!-- 
+    Document   : jfindmyfiles-drives-linux
+    Created on : 22/Jul/2008, 14:29:54
+    Author     : Administrador
+--&gt;
+&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01 Transitional//EN&quot;&gt;
+&lt;html&gt;
+  &lt;head&gt;
+    &lt;title&gt;Drives em Linux&lt;/title&gt;
+    &lt;meta http-equiv=&quot;Content-Type&quot; content=&quot;text/html; charset=UTF-8&quot;&gt;
+  &lt;/head&gt;
+  &lt;body&gt;
+       &lt;h2&gt;Drives em Linux&lt;/h2&gt;
+      &lt;p&gt;
+          Em Linux n&#227;o &#233; poss&#237;vel, at&#233; ao momento, determinar quais as drives correspondentes a
+    dispositivos de CD-ROM/DVD-ROM, FLAHS, discos externos, etc.
+    Para contornar este problema, existe na sec&#231;&#227;o de op&#231;&#245;es, um conjunto de defini&#231;&#245;es que
+    pode usar para configurar quais as pastas que deseja que sejam identificas como dispositivos a
+    ler.
+      &lt;/p&gt;
+  &lt;/body&gt;
+&lt;/html&gt;


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000246.html">[Jfindmyfiles-commits] r251 - trunk
</A></li>
	<LI>Next message: <A HREF="000248.html">[Jfindmyfiles-commits] r253 - in trunk: . docs docs/Documentos	Externos docs/Documentos Externos/Imagens Obtidas	docs/Imagens Criadas docs/Imagens Criadas/Exemplo de Utilizacao	project/JFindMyFiles/JFindMyFilesGui/javahelp/de/berlios/jfindmyfiles/jfindmyfilesgui/docs
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#247">[ date ]</a>
              <a href="thread.html#247">[ thread ]</a>
              <a href="subject.html#247">[ subject ]</a>
              <a href="author.html#247">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/jfindmyfiles-commits">More information about the Jfindmyfiles-commits
mailing list</a><br>
</body></html>
